#include <SFML/Graphics.hpp>

const int height_map = 19; //высота
const int width_map = 32; //ширина

// " " - обычная вода
// "0" - водоросли (препятствие)
// "d" - грязь внизу (препятствие)
// "k" - осьминог (декор)
// "c" - краб (декор)
// "y" - утка (декор)
// "u" - улитка горизонтальная (декор)
// "U" - улитка вертикальная (декор)
// "1" - папоротник средний (декор)
// "2" - папоротник жирный (декор)
// "3" - папоротник тонкий (декор)
// "4" - папоротник кривой (декор)

sf::String TileMap[height_map] =
{
	"00000000000000000000000000000000",
	"0                              0",
	"0U           3               c 0",
	"0            0               0 0",
	"0            0         0       0",
	"0     c   k  0   y     0       0",
	"04    0          0             0",
	"00  0            0             0",
	"00010            03          4 0",
	"00000     0      00          0 0",
	"0 00      0U            0    000",
	"02        00  1       3 0  0   0",
	"000        0  0       0 0u     0",
	"0          4          0000     0",
	"0        000       0       20  0",
	"0           0   0         00   0",
	"0   10 1 21 4  043  0  3c 1  120",
	"0dddddddddddddddddddddddddddddd0",
	"00000000000000000000000000000000",
};