#include <SFML/Graphics.hpp>

const int height_map = 19; //высота
const int width_map = 32; //ширина

// " " - обычная вода
// "0" - водоросли (препятствие)

sf::String TileMap[height_map] =
{
	"00000000000000000000000000000000",
	"0                              0",
	"0   0                          0",
	"0                              0",
	"0                              0",
	"0                              0",
	"0                              0",
	"0                              0",
	"0                              0",
	"0                              0",
	"0                              0",
	"0                              0",
	"0                              0",
	"0                              0",
	"0                              0",
	"0                              0",
	"0                              0",
	"0                              0",
	"00000000000000000000000000000000",
};